class ТранспортнийЗасіб:
    def __init__(self, назва, швидкість):
        self.назва = назва
        self.швидкість = швидкість

    def переміщення(self):
        print(f"{self.назва} рухається зі швидкістю {self.швидкість} км/год.")



class Автомобіль(ТранспортнийЗасіб):
    def __init__(self, назва, швидкість, тип_палива):
        super().__init__(назва, швидкість)
        self.тип_палива = тип_палива

    def переміщення(self):
        super().переміщення()
        print(f"{self.назва} їде по дорозі, використовуючи {self.тип_палива}.")


class Велосипед(ТранспортнийЗасіб):
    def __init__(self, назва, швидкість, тип):
        super().__init__(назва, швидкість)
        self.тип = тип

    def переміщення(self):
        super().переміщення()
        print(f"{self.назва} — це {self.тип} велосипед, який рухається за допомогою педалей.")


car = Автомобіль("Toyota Corolla", 180, "бензин")
bike = Велосипед("Cube Nature", 25, "гірський")

car.переміщення()
print()
bike.переміщення()
